def area(a):
    """
    Возвращает площадь квадрата
    (длина стороны в квадрате)

        Параметры:
            a : длина стороны

        Возвращаемое значение:
            a * a : площадь квадрата с заданным параметром
    """
    return a * a


def perimeter(a):
    """
        Возвращает периметр квадрата
        (четыре длины стороны)

            Параметры:
                a : длина стороны

            Возвращаемое значение:
                4 * a : периметр квадрата с заданным параметром
    """
    return 4 * a
